# Exercices du 23/09/2020
## Introduction

In [36]:
import pandas as pd

In [17]:
chemin = 'https://bit.ly/world-cities-clean'
data = pd.read_csv(chemin)

In [19]:
data.head()

               name               country          subcountry  geonameid
0      les Escaldes               Andorra  Escaldes-Engordany    3040051
1  Andorra la Vella               Andorra    Andorra la Vella    3041563
2    Umm al Qaywayn  United Arab Emirates      Umm al Qaywayn     290594
3    Ras al-Khaimah  United Arab Emirates     Raʼs al Khaymah     291074
4      Khawr Fakkān  United Arab Emirates        Ash Shāriqah     291696

# Exercice 1

chemin = 'chemin/qui/nexistepas'
data = pd.read_csv(chemin)

### No such file or directory: 'chemin/qui/nexistepas'

#### Cette erreur signifie "Aucun fichier ou dossier: 'chemin/qui/nexistepas' ", ce qui veut dire que le chemin permettant d'accèder au document souhaité n'existe pas.

# Exercice 2

In [32]:
chemin = 'https://bit.ly/world-cities-dirty-v1'
data = pd.read_csv(chemin, names = ['name', 'country', 'subcountry', 'geonameid'])

In [33]:
data.head()

               name               country          subcountry  geonameid
0      les Escaldes               Andorra  Escaldes-Engordany    3040051
1  Andorra la Vella               Andorra    Andorra la Vella    3041563
2    Umm al Qaywayn  United Arab Emirates      Umm al Qaywayn     290594
3    Ras al-Khaimah  United Arab Emirates     Raʼs al Khaymah     291074
4      Khawr Fakkān  United Arab Emirates        Ash Shāriqah     291696

### le fichier CSV ne contient pas de header et utilise par défaut la première ligne de donnée comme header

#### Pour empêcher cela, il faut ajouter le paramètre "names" à la méthode read_csv() qui permet de définir manuellement le nom des colones manquantes du fichier

# Exercice 3

In [98]:
chemin = 'https://bit.ly/world-cities-dirty-v2'
data = pd.read_csv(chemin, skiprows = 2, skipfooter = 1, encoding = 'utf-8')

<ipython-input-98-fa41b753b25d>:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  data = pd.read_csv(chemin, skiprows = 2, skipfooter = 1, encoding = 'utf-8')

In [99]:
data.head(24000)

                   name               country           subcountry  geonameid
0          les Escaldes               Andorra   Escaldes-Engordany    3040051
1      Andorra la Vella               Andorra     Andorra la Vella    3041563
2        Umm al Qaywayn  United Arab Emirates       Umm al Qaywayn     290594
3        Ras al-Khaimah  United Arab Emirates      Raʼs al Khaymah     291074
4          Khawr Fakkān  United Arab Emirates         Ash Shāriqah     291696
...                 ...                   ...                  ...        ...
23013          Bulawayo              Zimbabwe             Bulawayo     894701
23014           Bindura              Zimbabwe  Mashonaland Central     895061
23015        Beitbridge              Zimbabwe   Matabeleland South     895269
23016           Epworth              Zimbabwe               Harare    1085510
23017       Chitungwiza              Zimbabwe               Harare    1106542

[23018 rows x 4 columns]

# Exercice 4

In [104]:
chemin = 'https://bit.ly/world-cities-dirty-v3'
data = pd.read_csv(chemin, names = ['name', 'country', 'subcountry', 'geonameid'], sep = '|')

In [105]:
data.head()

               name               country          subcountry  geonameid
0      les Escaldes               Andorra  Escaldes-Engordany    3040051
1  Andorra la Vella               Andorra    Andorra la Vella    3041563
2    Umm al Qaywayn  United Arab Emirates      Umm al Qaywayn     290594
3    Ras al-Khaimah  United Arab Emirates     Raʼs al Khaymah     291074
4      Khawr Fakkān  United Arab Emirates        Ash Shāriqah     291696

# Exercice 5

In [106]:
chemin = 'https://bit.ly/bitcoin-data'
data = pd.read_csv(chemin)

In [109]:
data.shape

(33, 7)

In [111]:
data.dtypes

Date           object
Open*         float64
High          float64
Low           float64
Close**       float64
Volume        float64
Market Cap    float64
dtype: object

In [107]:
data.head()

          Date    Open*     High      Low  Close**        Volume    Market Cap
0  Jan 14 2020  8140.93  8879.51  8140.93  8827.76  4.484178e+10  1.603195e+11
1  Jan 13 2020  8189.77  8197.79  8079.70  8144.19  2.248291e+10  1.478905e+11
2  Jan 12 2020  8033.26  8200.06  8009.06  8192.49  2.290344e+10  1.487530e+11
3  Jan 11 2020  8162.19  8218.36  8029.64  8037.54  2.552117e+10  1.459242e+11
4  Jan 10 2020  7878.31  8166.55  7726.77  8166.55  2.871458e+10  1.482499e+11

In [108]:
data.tail()

,Date,Open*,High,Low,Close**,Volume,Market Cap
28,Dec 17 2019,6931.32,6964.07,6587.97,6640.52,2.236380e+10,1.202342e+11
29,Dec 16 2019,7153.66,7171.17,6903.68,6932.48,2.021327e+10,1.255156e+11
30,Dec 15 2019,7124.24,7181.08,6924.38,7152.30,1.688113e+10,1.294814e+11
31,* Earliest data in range (UTC time),NaN,NaN,NaN,NaN,NaN,NaN
32,** Latest data in range (UTC time),NaN,NaN,NaN,NaN,NaN,NaN

In [112]:
data.isna().sum()

Date          0
Open*         2
High          2
Low           2
Close**       2
Volume        2
Market Cap    2
dtype: int64

In [114]:
data = pd.read_csv(chemin, skipfooter = 2, encoding = 'utf-8')

<ipython-input-114-d47caef5a74f>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  data = pd.read_csv(chemin, skipfooter = 2, encoding = 'utf-8')

In [117]:
data.shape

(31, 7)

In [118]:
data.dtypes

Date           object
Open*         float64
High          float64
Low           float64
Close**       float64
Volume          int64
Market Cap      int64
dtype: object

In [119]:
data.head()

          Date    Open*     High      Low  Close**       Volume    Market Cap
0  Jan 14 2020  8140.93  8879.51  8140.93  8827.76  44841784107  160319484883
1  Jan 13 2020  8189.77  8197.79  8079.70  8144.19  22482910688  147890525973
2  Jan 12 2020  8033.26  8200.06  8009.06  8192.49  22903438381  148752956966
3  Jan 11 2020  8162.19  8218.36  8029.64  8037.54  25521165085  145924199942
4  Jan 10 2020  7878.31  8166.55  7726.77  8166.55  28714583844  148249907277

In [120]:
data.tail()

           Date    Open*     High      Low  Close**       Volume    Market Cap
26  Dec 19 2019  7277.59  7346.60  7041.38  7202.84  25904604416  130445758713
27  Dec 18 2019  6647.70  7324.98  6540.05  7276.80  31836522778  131754969804
28  Dec 17 2019  6931.32  6964.07  6587.97  6640.52  22363804217  120234244809
29  Dec 16 2019  7153.66  7171.17  6903.68  6932.48  20213265950  125515586952
30  Dec 15 2019  7124.24  7181.08  6924.38  7152.30  16881129804  129481424648

In [121]:
data.isna().sum()

Date          0
Open*         0
High          0
Low           0
Close**       0
Volume        0
Market Cap    0
dtype: int64

# Exercice 6

In [123]:
toy = pd.DataFrame(data = {'a' : [1, 2], 
                           'b' : [3, 3]})
toy.head()

   a  b
0  1  3
1  2  3

In [125]:
toy.rename(columns = str.upper)

   A  B
0  1  3
1  2  3

In [128]:
toy.rename(columns={"a": "A", "b": "B"})

   A  B
0  1  3
1  2  3

In [129]:
toy.rename(str.upper, axis = 'columns')

   A  B
0  1  3
1  2  3

In [133]:
toy.columns.str.upper()

Index(['A', 'B'], dtype='object')